# LOC / ILOC / TYPES

In [1]:
import pandas as pd

dados = pd.read_csv('C:/Users/vitor/Desktop/Estudos/Pessoas.csv',encoding='UTF-8',sep=',')
dados

,Nome,Sobrenome,Email,Idade,Cidade,Filhos,Altura,Atuação
0,Vitor,Duarte,vitor.duartegot@gmail.com,21,São Paulo,N,1.80,Tecnologia
1,Amanda,Roberta,amanda.robertinha@gmail.com,25,São Paulo,N,1.70,Saúde
2,Pedro,Souza,pedro147.souz@gmail.com,28,Rio de Janeiro,S,1.74,Meio Ambiente
3,Priscila,Pereira,priscila.pereira7@gmail.com,30,Porto Seguro,S,1.90,Medicina
4,Joaquim,Vieira,joaq.vieira256@gmail.com,23,Belo Horizonte,N,1.75,Engenharia
5,Thiago,Alvim,alvins.titi28@gmail.com,28,Florianópolis,N,1.65,Direito
6,Bruna,Silva,Brunasisi44@gmail.com,27,São Paulo,S,1.75,Arte
7,Fernando,Diamantino,Fernandin.diam878@gmail.com,23,Porto Alegre,S,1.84,Biotecnologia
8,Paula,Fernandes,paulaF.nades@gmail.com,29,Belém,N,1.80,Esportes
9,Thiago,Guimarães,guimares.tiago@gmail.com,35,São Paulo,S,1.69,Comunicação

In [2]:
select1 = dados.Filhos == 'S'

In [3]:
dados[select1]

,Nome,Sobrenome,Email,Idade,Cidade,Filhos,Altura,Atuação
2,Pedro,Souza,pedro147.souz@gmail.com,28,Rio de Janeiro,S,1.74,Meio Ambiente
3,Priscila,Pereira,priscila.pereira7@gmail.com,30,Porto Seguro,S,1.90,Medicina
6,Bruna,Silva,Brunasisi44@gmail.com,27,São Paulo,S,1.75,Arte
7,Fernando,Diamantino,Fernandin.diam878@gmail.com,23,Porto Alegre,S,1.84,Biotecnologia
9,Thiago,Guimarães,guimares.tiago@gmail.com,35,São Paulo,S,1.69,Comunicação

In [5]:
dados.dtypes

Nome          object
Sobrenome     object
Email         object
Idade          int64
Cidade        object
Filhos        object
Altura       float64
Atuação       object
dtype: object

In [6]:
dados[(dados.Idade == 23) & (dados.Filhos == 'S') & (dados.Nome == 'Fernando')]

,Nome,Sobrenome,Email,Idade,Cidade,Filhos,Altura,Atuação
7,Fernando,Diamantino,Fernandin.diam878@gmail.com,23,Porto Alegre,S,1.84,Biotecnologia

In [8]:
dados['Idade'].value_counts()

28    2
23    2
30    1
29    1
27    1
25    1
21    1
35    1
Name: Idade, dtype: int64

In [2]:
dados

,Nome,Sobrenome,Email,Idade,Cidade,Filhos,Altura,Atuação
0,Vitor,Duarte,vitor.duartegot@gmail.com,21,São Paulo,N,1.80,Tecnologia
1,Amanda,Roberta,amanda.robertinha@gmail.com,25,São Paulo,N,1.70,Saúde
2,Pedro,Souza,pedro147.souz@gmail.com,28,Rio de Janeiro,S,1.74,Meio Ambiente
3,Priscila,Pereira,priscila.pereira7@gmail.com,30,Porto Seguro,S,1.90,Medicina
4,Joaquim,Vieira,joaq.vieira256@gmail.com,23,Belo Horizonte,N,1.75,Engenharia
5,Thiago,Alvim,alvins.titi28@gmail.com,28,Florianópolis,N,1.65,Direito
6,Bruna,Silva,Brunasisi44@gmail.com,27,São Paulo,S,1.75,Arte
7,Fernando,Diamantino,Fernandin.diam878@gmail.com,23,Porto Alegre,S,1.84,Biotecnologia
8,Paula,Fernandes,paulaF.nades@gmail.com,29,Belém,N,1.80,Esportes
9,Thiago,Guimarães,guimares.tiago@gmail.com,35,São Paulo,S,1.69,Comunicação

In [6]:
dados[['Nome']]

       Nome
0     Vitor
1    Amanda
2     Pedro
3  Priscila
4   Joaquim
5    Thiago
6     Bruna
7  Fernando
8     Paula
9    Thiago

In [14]:
dados.loc[0,'Nome'] #errado dados.loc[[0,'Nome']]

'Vitor'

In [19]:
dados.loc[1]

Nome                              Amanda
Sobrenome                        Roberta
Email        amanda.robertinha@gmail.com
Idade                                 25
Cidade                         São Paulo
Filhos                                 N
Altura                               1.7
Atuação                            Saúde
Name: 1, dtype: object

In [34]:
type(dados.loc[1])

pandas.core.series.Series

In [16]:
dados.loc[[1]]

,Nome,Sobrenome,Email,Idade,Cidade,Filhos,Altura,Atuação
1,Amanda,Roberta,amanda.robertinha@gmail.com,25,São Paulo,N,1.7,Saúde

In [35]:
type(dados.loc[[1]])

pandas.core.frame.DataFrame

In [18]:
dados.loc[1:5]

,Nome,Sobrenome,Email,Idade,Cidade,Filhos,Altura,Atuação
1,Amanda,Roberta,amanda.robertinha@gmail.com,25,São Paulo,N,1.70,Saúde
2,Pedro,Souza,pedro147.souz@gmail.com,28,Rio de Janeiro,S,1.74,Meio Ambiente
3,Priscila,Pereira,priscila.pereira7@gmail.com,30,Porto Seguro,S,1.90,Medicina
4,Joaquim,Vieira,joaq.vieira256@gmail.com,23,Belo Horizonte,N,1.75,Engenharia
5,Thiago,Alvim,alvins.titi28@gmail.com,28,Florianópolis,N,1.65,Direito

In [32]:
dados.iloc[1]

Nome                              Amanda
Sobrenome                        Roberta
Email        amanda.robertinha@gmail.com
Idade                                 25
Cidade                         São Paulo
Filhos                                 N
Altura                               1.7
Atuação                            Saúde
Name: 1, dtype: object

In [36]:
type(dados.iloc[1])

pandas.core.series.Series

In [33]:
dados.iloc[[1]]

,Nome,Sobrenome,Email,Idade,Cidade,Filhos,Altura,Atuação
1,Amanda,Roberta,amanda.robertinha@gmail.com,25,São Paulo,N,1.7,Saúde

In [23]:
dados.iloc[1:5]

,Nome,Sobrenome,Email,Idade,Cidade,Filhos,Altura,Atuação
1,Amanda,Roberta,amanda.robertinha@gmail.com,25,São Paulo,N,1.70,Saúde
2,Pedro,Souza,pedro147.souz@gmail.com,28,Rio de Janeiro,S,1.74,Meio Ambiente
3,Priscila,Pereira,priscila.pereira7@gmail.com,30,Porto Seguro,S,1.90,Medicina
4,Joaquim,Vieira,joaq.vieira256@gmail.com,23,Belo Horizonte,N,1.75,Engenharia

In [29]:
dados[['Nome']]

       Nome
0     Vitor
1    Amanda
2     Pedro
3  Priscila
4   Joaquim
5    Thiago
6     Bruna
7  Fernando
8     Paula
9    Thiago

In [30]:
dados['Nome']

0       Vitor
1      Amanda
2       Pedro
3    Priscila
4     Joaquim
5      Thiago
6       Bruna
7    Fernando
8       Paula
9      Thiago
Name: Nome, dtype: object